perftests/smol-run3.log
hey -z 30s -m GET -cpus 4 -c 200 http://localhost:9000/smol-perf

Summary:
  Total:	30.0011 secs
  Slowest:	0.0773 secs
  Fastest:	0.0000 secs
  Average:	0.0088 secs
  Requests/sec:	22620.9484
  
  Total data:	25786154 bytes
  Size/request:	38 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [280164]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.015 [318696]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.023 [76819]	|■■■■■■■■■■
  0.031 [2491]	|
  0.039 [287]	|
  0.046 [79]	|
  0.054 [28]	|
  0.062 [15]	|
  0.070 [2]	|
  0.077 [1]	|


Latency distribution:
  10% in 0.0015 secs
  25% in 0.0027 secs
  50% in 0.0095 secs
  75% in 0.0131 secs
  90% in 0.0159 secs
  95% in 0.0177 secs
  99% in 0.0210 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0773 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0430 secs
  resp wait:	0.0085 secs, 0.0000 secs, 0.0773 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0544 secs

Status code distribution:
  [200]	678583 responses

Error distribution:
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62339->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62340->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62341->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62342->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62343->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62344->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62345->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62346->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62347->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62348->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62349->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62350->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62351->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62352->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62353->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62354->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62355->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62356->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62357->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62358->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62359->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62360->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62361->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62362->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62363->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62364->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62365->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62366->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62367->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62368->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62369->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62370->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62371->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62372->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62373->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62374->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62375->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62376->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62377->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62378->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62379->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62380->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62381->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62382->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62383->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62384->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62385->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62386->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62387->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62388->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62389->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62390->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62391->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62392->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62393->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62394->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62395->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62396->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62397->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62398->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62399->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62400->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62401->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62402->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62403->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62404->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62405->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62406->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62407->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp [::1]:62408->[::1]:9000: read: connection reset by peer